КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработчики</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СобытияОбработчиковПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОбработкиПослеЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛиц/КонтурЛогистика_ТипыЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛиц</name>
  <enumValues>
    <name>ИП</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ОрганИсполнительнойВласти</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		КодПартнераКонтур 	= ДанныеЗаполнения.КодПартнераКонтур;
		Наименование 		= ДанныеЗаполнения.Наименование;
		ДатаОбновления 		= ДанныеЗаполнения.ДатаОбновления;
		ГП = Истина;
		
		ОрганизацияДД = Неопределено;
		Если ДанныеЗаполнения.Свойство("ОрганизацияДД") Тогда 
			ОрганизацияДД 	= ДанныеЗаполнения.ОрганизацияДД;
		КонецЕсли;
		
		ДанныеСети = КонтурЛогистика_ИнтеграцияEDI_Сервер.ПолучитьСтруктуруДанныхТорговойСети(КодПартнераКонтур);
		
		Если ДанныеСети = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДанныеОрганизаций(ДанныеСети, КодПартнераКонтур, ОрганизацияДД);
		
		ЗаполнятьТочкиДоставки = Истина;
		Если ДанныеЗаполнения.Свойство("ЗаполнятьТочкиДоставки") Тогда
			ЗаполнятьТочкиДоставки = ДанныеЗаполнения.ЗаполнятьТочкиДоставки;
		КонецЕсли;
		
		Если ЗаполнятьТочкиДоставки Тогда
			ЗаполнитьДанныеТочекДоставки(ДанныеСети);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеТочекДоставки(Знач ДанныеСети)
	
	Перем НоваяСтрокаТочкиДоставки, СтрДоставки;
	
	ПунктыМаршрута.Очистить();
	
	Для Каждого СтрДоставки Из ДанныеСети.ТочкиДоставки Цикл
		
		НоваяСтрокаТочкиДоставки = ПунктыМаршрута.Добавить();
		НоваяСтрокаТочкиДоставки.GLN 			= СтрДоставки.GLN;
		НоваяСтрокаТочкиДоставки.КПП 			= СтрДоставки.КПП;
		НоваяСтрокаТочкиДоставки.АдресИндекс 	= СтрДоставки.Индекс;
		НоваяСтрокаТочкиДоставки.АдресСтрока	= СтрДоставки.Адрес;
		НоваяСтрокаТочкиДоставки.АдресКодРегион	= СтрДоставки.КодРегиона;
		НоваяСтрокаТочкиДоставки.Название		= СтрДоставки.Наименование;
		НоваяСтрокаТочкиДоставки.Прибытие		= Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОрганизаций(Знач ДанныеСети, КодПартнераКонтур, ОрганизацияДД)
	
	Перем НайденнаяОрганизация, НоваяОрганизация, НоваяСтрокаОрги, СтрОрганизации;
	
	МассивОрганизаций = Новый Массив;
	
	Если КодПартнераКонтур = "small_retail" И ЗначениеЗаполнено(ОрганизацияДД) Тогда
		
		// для партнера small_retail не будем создавать весь список орг, а будем добавлять по одной
		// в процессе оформления титула 
		МассивОрганизаций.Добавить(ОрганизацияДД);
		
		НоваяСтрокаОрги = ОрганизацииДиадок.Добавить();
		НоваяСтрокаОрги.Организация = ОрганизацияДД;
		НоваяСтрокаОрги.boxId = ОрганизацияДД.ID;
		НоваяСтрокаОрги.ГП = Истина;
		
	Иначе
	
		ОрганизацииДиадок.Очистить();
		
		Для Каждого СтрОрганизации Из ДанныеСети.ЮрФизЛица Цикл 
			
			// найти/создать оргу
			НайденнаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиОрганизациюПоКлючевымРеквизитам(СтрОрганизации.ИНН, СтрОрганизации.КПП);
			
			ИспользоватьНайденную = ЗначениеЗаполнено(НайденнаяОрганизация);
			
			Если ИспользоватьНайденную Тогда
				
				КППPARTIN = СокрЛП(СтрОрганизации.КПП);
				КППНайденной = СокрЛП(НайденнаяОрганизация.КПП);
				
				// Fallback поиска по ИНН мог вернуть организацию с другим КПП — не переиспользуем
				Если ЗначениеЗаполнено(КППPARTIN)
					И ЗначениеЗаполнено(КППНайденной)
					И КППНайденной <> КППPARTIN Тогда
					
					ИспользоватьНайденную = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИспользоватьНайденную Тогда
				
				НужноОбновитьGLN = НайденнаяОрганизация.GLN <> СтрОрганизации.GLN
					И СокрЛП(НайденнаяОрганизация.GLN) = "";
				НужноОбновитьКПП = Не ЗначениеЗаполнено(НайденнаяОрганизация.КПП)
					И ЗначениеЗаполнено(СтрОрганизации.КПП);
				
				Если НужноОбновитьGLN Или НужноОбновитьКПП Тогда
					
					НоваяОрганизация = НайденнаяОрганизация.ПолучитьОбъект();
					
					Если НужноОбновитьGLN Тогда
						НоваяОрганизация.GLN = СтрОрганизации.GLN;
					КонецЕсли;
					
					Если НужноОбновитьКПП Тогда
						НоваяОрганизация.КПП = СокрЛП(СтрОрганизации.КПП);
					КонецЕсли;
					
					НоваяОрганизация.Грузополучатель = Истина;
					НоваяОрганизация.Записать();
					
				КонецЕсли;
				
			Иначе
				
				НоваяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
				НоваяОрганизация.GLN = СтрОрганизации.GLN;
				НоваяОрганизация.ИНН = СтрОрганизации.ИНН;
				НоваяОрганизация.КПП = СтрОрганизации.КПП;
				НоваяОрганизация.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо;
				НоваяОрганизация.Наименование = СтрОрганизации.Наименование;
				НоваяОрганизация.НаименованиеОрганизацииПолное = СтрОрганизации.Наименование;
				НоваяОрганизация.Грузополучатель = Истина;
				НоваяОрганизация.Записать();
				
				МассивОрганизаций.Добавить(НоваяОрганизация.Ссылка);
				
				Попытка
					
					// синхронизировать из логистики
					Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ApiKeyЗаполненДляОрганизаций() Тогда 
						НоваяОрганизация.СинхронизироватьИзСервисаЛогистика();
					КонецЕсли;
					
				Исключение
					// проблема - нет в диадоке, не ожидаем такого. Anyway, ок, че, пусть остается
				КонецПопытки;
				
				НайденнаяОрганизация = НоваяОрганизация.Ссылка;
				
			КонецЕсли;
			
			НоваяСтрокаОрги = ОрганизацииДиадок.Добавить();
			НоваяСтрокаОрги.Организация = НайденнаяОрганизация;
			НоваяСтрокаОрги.boxId = НайденнаяОрганизация.ID;
			НоваяСтрокаОрги.ГП = Истина;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// запустим автосоответствия для вновь созданных
	Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок(МассивОрганизаций);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ = Ложь Тогда 
		ОбработатьУстаревшиеТочкиДоставки();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
		
КонецПроцедуры

Процедура ОбработатьУстаревшиеТочкиДоставки()
	
	Перем Выборка, Запрос, ПунктМаршрутаОбъект, Результат;
	
	// пометить удаленными точки доставки с этим кодом сети в которых есть GLN и такого GLN теперь нет в 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_ПунктыМаршрута.Ссылка КАК Ссылка,
	               |	КонтурЛогистика_ПунктыМаршрута.GLN КАК GLN
	               |ПОМЕСТИТЬ ВТ_ПунктыМаршрутаПартнера
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ПунктыМаршрута КАК КонтурЛогистика_ПунктыМаршрута
	               |ГДЕ
	               |	НЕ КонтурЛогистика_ПунктыМаршрута.ПометкаУдаления
	               |	И КонтурЛогистика_ПунктыМаршрута.GLN <> """"
	               |	И КонтурЛогистика_ПунктыМаршрута.КодПартнераКонтур = &КодПартнераКонтур
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПартнерыПунктыМаршрута.GLN КАК GLN
	               |ПОМЕСТИТЬ ВТ_АктуальныеGLN
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Партнеры.ПунктыМаршрута КАК КонтурЛогистика_ПартнерыПунктыМаршрута
	               |ГДЕ
	               |	КонтурЛогистика_ПартнерыПунктыМаршрута.Ссылка.КодПартнераКонтур = &КодПартнераКонтур
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПунктыМаршрутаПартнера.Ссылка КАК Ссылка,
	               |	ВТ_АктуальныеGLN.GLN КАК GLNАктуальный,
	               |	ВТ_ПунктыМаршрутаПартнера.GLN КАК GLNТекущий
	               |ИЗ
	               |	ВТ_ПунктыМаршрутаПартнера КАК ВТ_ПунктыМаршрутаПартнера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктуальныеGLN КАК ВТ_АктуальныеGLN
	               |		ПО ВТ_ПунктыМаршрутаПартнера.GLN = ВТ_АктуальныеGLN.GLN
	               |ГДЕ
	               |	ВТ_АктуальныеGLN.GLN ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КодПартнераКонтур", КодПартнераКонтур);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПунктМаршрутаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПунктМаршрутаОбъект.Наименование = "УДАЛЕН ПАРТНЕРОМ " + ПунктМаршрутаОбъект.Наименование;
		ПунктМаршрутаОбъект.GLN = "";
		ПунктМаршрутаОбъект.Записать();
		ПунктМаршрутаОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// проверим что не ввели дубли настроек
	ТабНастроек = Настройки.Выгрузить(,"Настройка");
	СтрокНастроек = ТабНастроек.Количество();
	ТабНастроек.Свернуть("Настройка");
	СтрокСвернутых = ТабНастроек.Количество();
	Если СтрокНастроек <> СтрокСвернутых Тогда
		Отказ = Истина;
		Сообщить("В партнере есть дубли настроек. Перед записью удалите дублирующиеся строки");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
